---
kind: property
id: P:Autodesk.Revit.DB.Line.Direction
zh: 线、直线
source: html/5917cf6b-0e7a-e0ba-7155-e8b3fccb283e.htm
---
# Autodesk.Revit.DB.Line.Direction Property

**中文**: 线、直线

Returns the direction of the line.

## Syntax (C#)
```csharp
public XYZ Direction { get; }
```